{"pages":[],"posts":[{"title":"CCP - DevOps","text":"Coretronic Cloud Platform DevOpsProject Build Status IdentityServer AdminWeb WebAPI &amp; IoT WebAPI Project Timelinegantt title Coretronic Cloud Platform Gantt Diagram dateFormat YYYY-MM-DD axisFormat %m/%d section Identity Single sign-on :done, sso, 2019-06-01, 30d section Device Device :done, d, 2019-06-01, 10d License :done, l, 2019-06-10, 10d Opening :done, after l, 10d section IoTHub Server :done, crit, 2019-07-01 , 60d Agent :crit, 2019-07-25, 60d section OTA Firmware :crit, 2019-08-01, 60d Software :crit, 2019-09-01, 60d section Remote Call:done, 2019-08-01, 30d Customer Remote : 2019-09-01, 60d section Analysis Collect : 2019-09-01, 30d Analysis : 2019-10-01, 30d","link":"/2020/04/18/CCP-DevOps/"},{"title":"CCP - Roadmap","text":"Coretronic Cloud Platform Roadmap","link":"/2020/04/15/CCP-Roadmap/"},{"title":"CCP - Identity Server","text":"Identity Server Specifications &amp; Flows Identity Server is an OpenID Connect and OAuth 2.0 framework It enables the following features in your applications: 1. Authentication as a ServiceCentralized login logic and workflow for all of your applications (web, native, mobile, services). IdentityServer is an officially certified implementation of OpenID Connect. 2. Single Sign-on / Sign-outSingle sign-on (and out) over multiple application types. 3. Access Control for APIsIssue access tokens for APIs for various types of clients, e.g. server to server, web applications, SPAs and native/mobile apps. Terminology IdentityServerIdentityServer is an OpenID Connect provider - it implements the OpenID Connect and OAuth 2.0 protocols. Resource Owner: UserA user is a human that is using a registered client to access resources. Client: ApplicationA client is a piece of software that requests tokens from IdentityServer - either for authenticating a user (requesting an identity token) or for accessing a resource (requesting an access token). A client must be first registered with IdentityServer before it can request tokens. Resource: APIResources are something you want to protect with IdentityServer - either identity data of your users, or APIs.Every resource has a unique name - and clients use this name to specify to which resources they want to get access to.Identity data Identity information (aka claims) about a user, e.g. name or email address.APIs APIs resources represent functionality a client wants to invoke - typically modelled as Web APIs, but not necessarily. Identity TokenAn identity token represents the outcome of an authentication process. It contains at a bare minimum an identifier for the user (called the sub aka subject claim) and information about how and when the user authenticated. It can contain additional identity data. Access TokenAn access token allows access to an API resource. Clients request access tokens and forward them to the API. Access tokens contain information about the client and the user (if present). APIs use that information to authorize access to their data.","link":"/2020/04/15/Identity-Server-Specifications-Flows/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/04/15/hello-world/"}],"tags":[{"name":"Coretronic Cloud Platform, Documentation","slug":"Coretronic-Cloud-Platform-Documentation","link":"/tags/Coretronic-Cloud-Platform-Documentation/"},{"name":"Coretronic Cloud Platform Identity Server","slug":"Coretronic-Cloud-Platform-Identity-Server","link":"/tags/Coretronic-Cloud-Platform-Identity-Server/"}],"categories":[]}